For pipeform to output the conventional Terraform command output, pipeform needs to convert the output of `terraform plan -json` to the conventional Terraform command output.
This means the output of `terraform plan -json` needs to include all information of the conventional Terraform command output.

I checked the output of `terraform plan -json`, but seems like it doesn't include the information of resource attributes.

For instance, `terraform plan -json` outputs the data like this:

```json
{
  "@level": "info",
  "@message": "github_issue_label.fooo: Plan to create",
  "@module": "terraform.ui",
  "@timestamp": "2025-01-15T22:33:03.343780+09:00",
  "change": {
    "resource": {
      "addr": "github_issue_label.fooo",
      "module": "",
      "resource": "github_issue_label.fooo",
      "implied_provider": "github",
      "resource_type": "github_issue_label",
      "resource_name": "fooo",
      "resource_key": null
    },
    "action": "create"
  },
  "type": "planned_change"
}
```

We can see the resource github_issue_label.fooo is created, but we can't see the attributes of the resource.
We can't convert this output to the conventional output like this:

```tf
  # github_issue_label.fooo will be created
  + resource "github_issue_label" "fooo" {
      + color       = "FF0000"
      + description = "foo"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "fooo"
      + repository  = "hoge"
      + url         = (known after apply)
    }
```